// Lab_02.cpp
// Галик Мирослав
// Лабораторна робота №2.
// Лінійні програми.
// Варіант 10
#include <iostream>		// підключаємо бібліотеку вводу-виводу
						// - містить опис всіх функцій, які
						// забезпечують ввід-вивід

#include <cmath>		// для математичних функцій (sin, cos, atan)

using namespace std;	 // використовуємо стандартний простір імен
						// - після цього доступ до ресурсів
						// бібліотеки вводу-виводу буде не громіздкий,
						// а компактний

int main()				// головна функція - програма починає виконання
{						// із функції main()
	double Pi = 4 * atan(1.);	 // число пі

	double a; // вхідний параметр
	double z1; // результат обчислення 1-го виразу
	double z2; // результат обчислення 2-го виразу

	cout << "a = "; cin >> a;
	
	//Обчислення
	z1 = sin(Pi / 2 + 3 * a) / (1 - sin(3 * a - Pi));

	double arg = (5.0 / 4) * Pi + (3.0 / 2) * a;
	z2 = cos(arg) / sin(arg);	 // ctg(x) = cos(x)/sin(x)

	// вивід результатів
	cout << endl;
	cout << "z1 = " << z1 << endl;
	cout << "z2 = " << z2 << endl;



	return 0;			// нульовий результат = сигнал для операційної
}						// системи, що програма завершилася успішно
